In [1]:
import pandas as pd

In [4]:
d=pd.Series() #empty series S capital

In [5]:
d

Series([], dtype: object)

In [8]:
print(type(d)) #checking type

<class 'pandas.core.series.Series'>

In [10]:
d=pd.Series(17) #creating series with one element

In [11]:
d

0    17
dtype: int64

In [15]:
#creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [16]:
##creating series using list
d=pd.Series([45,78,56,445,78])

In [17]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [19]:
##Creating series with arrqy
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [21]:
arr2=np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [24]:
s2=pd.Series(arr2)

ValueError: Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [25]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [26]:
##using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [27]:
d.values()

dict_values([1, 2, 3, 4])

In [28]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [29]:
d.items()

dict_items([('a', 1), ('b', 2), ('c', 3), ('d', 4)])

In [30]:
d['a']

1

In [32]:
b=pd.Series(d)
b

a    1
b    2
c    3
d    4
dtype: int64

In [33]:
b[0]

C:\Users\pspat\AppData\Local\Temp\ipykernel_260\172979841.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  b[0]

1

In [34]:
b['a']

1

In [35]:
import numpy as np

In [40]:
s1=pd.Series(arr_2)
s1

NameError: name 'arr_2' is not defined

In [41]:
##slicing operation
d=pd.Series([1,2,3,4,5,47,98,7,8,6,32,78,2,8,289,78])
d[:-8:2]

0     1
2     3
4     5
6    98
dtype: int64

In [42]:
d[0:9]

0     1
1     2
2     3
3     4
4     5
5    47
6    98
7     7
8     8
dtype: int64

In [43]:
d[[4,5,6]] #multiple index

4     5
5    47
6    98
dtype: int64

In [45]:
d[4]=34 ##changing the element

In [46]:
d[[4,5,6]]

4    34
5    47
6    98
dtype: int64

In [47]:
d[6:10]=[100,200,300,400]
d

0       1
1       2
2       3
3       4
4      34
5      47
6     100
7     200
8     300
9     400
10     32
11     78
12      2
13      8
14    289
15     78
dtype: int64

In [48]:
#import numpy as np
#import pandas as pd

arr3=np.array([1,2,3,6])
s=pd.Series(arr3,index=['one','two','three','four'])
s

one      1
two      2
three    3
four     6
dtype: int32

In [50]:
arr4=np.array([1,2,4,6])
s1=pd.Series(arr4)
s1

0    1
1    2
2    4
3    6
dtype: int32

In [51]:
print (s)

one      1
two      2
three    3
four     6
dtype: int32

Data Frame

In [75]:
import pandas as pd
#empty dataframe
d=pd.DataFrame()

In [76]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [77]:
d

Empty DataFrame
Columns: []
Index: []

In [78]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [79]:
#import pandas as pd

data=[['abc',1],['def',2],['ghi',3],['','hij'],['klm','a']]

In [80]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'hij'], ['klm', 'a']]

In [81]:
d1=pd.DataFrame(data)
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       hij
4  klm    a

In [82]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## chnaging the column 


d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [83]:
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       hij
E  klm    a

In [84]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [85]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [86]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)

In [87]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [88]:
d.rename({'Candidate':'Candidate112','Age_years':'Age_years112'},axis=1,inplace=True)

In [89]:
d

  Candidate112  Age_years112
0            a            45
1            b            12
2            c            48
3            d            25
4            e            12
5            f            56

In [93]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['pranav',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [95]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['pranav', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [94]:
data[2][0]

'pranav'

In [96]:
data[2][0]='asdf'

In [97]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [98]:
import pandas as pd

In [99]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [100]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [102]:
d[1,1]

KeyError: (1, 1)

In [103]:
d.Name

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [104]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [105]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2   asdf      Eco
3  Boris      Geo
4    Ken  English

In [106]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [109]:
d.iloc[1,1]  #index location

12

In [ ]:
#d[0,0]

In [108]:
d.iloc[0,0] ="ALEX"  # changing an element
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [110]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [111]:
d['Gender'] = "Male"  # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALEX   10    Maths   Male
1    Bob   12  Science   Male
2   asdf   15      Eco   Male
3  Boris   14      Geo   Male
4    Ken   18  English   Male

In [112]:
d['Age'] = d['Age'] - 1   # d['Age']-=1
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [113]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALEX    9
1    Bob   11
2   asdf   14
3  Boris   13
4    Ken   17

In [114]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   13
1    Bob   11

In [115]:
d.iloc[1:3,[0,1]]

   Name  Age
1   Bob   11
2  asdf   14

In [116]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Gender        Male
Name: 1, dtype: object

In [117]:
pwd

'C:\\Users\\pspat\\Desktop\\data science\\21aug'

In [118]:
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [119]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

'Maths'

loc used for locating with column names

In [120]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

   Name  Subject
0  ALEX    Maths
1   Bob  Science
2  asdf      Eco

In [121]:
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [122]:
d.loc[:,1]

KeyError: 1

In [124]:
# loc is typically used for accessing columns. 
d['Age']
d.loc[:,'Age']
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [125]:
d.loc[3] ## getting the rows with singular index value

Name       Boris
Age           13
Subject      Geo
Gender      Male
Name: 3, dtype: object

In [126]:
d.iloc[:,[1,2]]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco
3   13      Geo
4   17  English

In [127]:
d.iloc[:3,1:3]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco

In [131]:
#must focus on Data Frames thet will be very usefull in Data Science
#next is manipolution
#and create separate numpy and pandas notebook (functions)